In [51]:
import pandas as pd

In [52]:
df = pd.read_csv("data.csv")
df_col = df.copy()

In [53]:
df_col.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [54]:
#re-ordering columns
df_col_reordering = df_col[['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked','Name']]
df_col_reordering.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,"Braund, Mr. Owen Harris"
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"Heikkinen, Miss. Laina"
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,"Allen, Mr. William Henry"

In [55]:
# df_col_reordering["new"]= df_col_reordering["Name"].str.split(", ", expand=True).loc[:,0]
df_col["First_Name"] = df_col["Name"].str.split(", ", expand=True)[0]
df_col["Last_Name_Title"] = df_col["Name"].str.split(", ", expand=True)[1]
df_col.drop(columns=["Name"], inplace=True)
df_col.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First_Name,Last_Name_Title
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

In [56]:
df_col["Pass_Title"] = df_col["Last_Name_Title"].str.split(". ", expand=True)[0]
df_col["Last_Name"] = df_col["Last_Name_Title"].str.split(". ", expand=True)[1]
df_col.drop(columns=["Last_Name_Title"], inplace=True)
df_col.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First_Name,Pass_Title,Last_Name
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr,Owe
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs,Joh
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss,Laina
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs,Jacque
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr,Willia

In [57]:
df_col_fixed = df_col[['PassengerId', 'Survived', 'Pclass', 'Pass_Title', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'First_Name',
       'Last_Name']]
df_col_fixed.rename(columns={"Sex":"Gender"}, inplace=True)
df_col_fixed.head()

,PassengerId,Survived,Pclass,Pass_Title,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First_Name,Last_Name
0,1,0,3,Mr,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Owe
1,2,1,1,Mrs,female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Joh
2,3,1,3,Miss,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Laina
3,4,1,1,Mrs,female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Jacque
4,5,0,3,Mr,male,35.0,0,0,373450,8.0500,NaN,S,Allen,Willia

In [58]:
df_col_fixed["Pass_Title"].value_counts()

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Col           2
Major         2
Mlle          2
Don           1
Lady          1
Jonkheer      1
Ms            1
th            1
Mme           1
Sir           1
Capt          1
Name: Pass_Title, dtype: int64

In [59]:
df_col_fixed["Pass_Title"].value_counts().isna()

Mr          False
Miss        False
Mrs         False
Master      False
Dr          False
Rev         False
Col         False
Major       False
Mlle        False
Don         False
Lady        False
Jonkheer    False
Ms          False
th          False
Mme         False
Sir         False
Capt        False
Name: Pass_Title, dtype: bool

In [60]:
df_col_fixed.groupby(["Pass_Title"])["Survived"].count().sort_values(ascending=False)

Pass_Title
Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Col           2
Mlle          2
Major         2
Jonkheer      1
Don           1
th            1
Lady          1
Sir           1
Mme           1
Ms            1
Capt          1
Name: Survived, dtype: int64

In [61]:
Title = df_col_fixed.groupby(["Pass_Title"])
Title.get_group("th")

,PassengerId,Survived,Pclass,Pass_Title,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,First_Name,Last_Name
759,760,1,1,th,female,33.0,0,0,110152,86.5,B77,S,Rothes,Countess

In [62]:
df_col.iloc[759]

PassengerId         760
Survived              1
Pclass                1
Sex              female
Age                  33
SibSp                 0
Parch                 0
Ticket           110152
Fare               86.5
Cabin               B77
Embarked              S
First_Name       Rothes
Pass_Title           th
Last_Name      Countess
Name: 759, dtype: object

In [63]:
df.loc[759,"Name"]

'Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)'

In [65]:
df_col_fixed.loc[759]

PassengerId         760
Survived              1
Pclass                1
Pass_Title           th
Gender           female
Age                  33
SibSp                 0
Parch                 0
Ticket           110152
Fare               86.5
Cabin               B77
Embarked              S
First_Name       Rothes
Last_Name      Countess
Name: 759, dtype: object

In [69]:
df_col_fixed.loc[759, "Pass_Title"] = "the Countess. of"
df_col_fixed.loc[759]

PassengerId                 760
Survived                      1
Pclass                        1
Pass_Title     the Countess. of
Gender                   female
Age                          33
SibSp                         0
Parch                         0
Ticket                   110152
Fare                       86.5
Cabin                       B77
Embarked                      S
First_Name               Rothes
Last_Name              Countess
Name: 759, dtype: object

In [72]:
df_col_fixed.loc[759,"Last_Name"] = "(Lucy Noel Martha Dyer-Edwards)"
df_col_fixed.loc[759]

PassengerId                                760
Survived                                     1
Pclass                                       1
Pass_Title                    the Countess. of
Gender                                  female
Age                                         33
SibSp                                        0
Parch                                        0
Ticket                                  110152
Fare                                      86.5
Cabin                                      B77
Embarked                                     S
First_Name                              Rothes
Last_Name      (Lucy Noel Martha Dyer-Edwards)
Name: 759, dtype: object

In [76]:
df_col_fixed["Pass_Title"].value_counts()

Mr                  517
Miss                182
Mrs                 125
Master               40
Dr                    7
Rev                   6
Col                   2
Major                 2
Mlle                  2
Jonkheer              1
Don                   1
Lady                  1
the Countess. of      1
Ms                    1
Mme                   1
Sir                   1
Capt                  1
Name: Pass_Title, dtype: int64

In [112]:
T = df_col_fixed.groupby(["Pass_Title","Gender"])["Survived"].sum()
T.sort_index(level=1)

Pass_Title        Gender
Dr                female      1
Lady              female      1
Miss              female    127
Mlle              female      2
Mme               female      1
Mrs               female     99
Ms                female      1
the Countess. of  female      1
Capt              male        0
Col               male        1
Don               male        0
Dr                male        2
Jonkheer          male        0
Major             male        1
Master            male       23
Mr                male       81
Rev               male        0
Sir               male        1
Name: Survived, dtype: int64

In [121]:
T1 = T.reset_index()
T1["Sum_Gender"] = T1["Survived"].groupby(T1["Gender"]).transform("sum")
T1.sort_values(["Gender"])

# grp["Survived"].groupby(grp["Pclass"]).transform("sum")

          Pass_Title  Gender  Survived  Sum_Gender
17  the Countess. of  female         1         233
14                Ms  female         1         233
3                 Dr  female         1         233
13               Mrs  female        99         233
6               Lady  female         1         233
11               Mme  female         1         233
10              Mlle  female         2         233
9               Miss  female       127         233
15               Rev    male         0         109
12                Mr    male        81         109
0               Capt    male         0         109
7              Major    male         1         109
5           Jonkheer    male         0         109
4                 Dr    male         2         109
2                Don    male         0         109
1                Col    male         1         109
16               Sir    male         1         109
8             Master    male        23         109